I am having the same issue, but using a self-signed certificate:

main.tf
`
resource "tls_self_signed_cert" "test_selfsigned_cert" {
  key_algorithm   = "RSA"
  private_key_pem = tls_private_key.test-matcher-key.private_key_pem

  subject {
    common_name  = aws_lb.bic-balancer.dns_name
    organization = "test Org"
  }

  validity_period_hours = 12

  allowed_uses = [
    "key_encipherment",
    "digital_signature",
    "server_auth",
  ]
}

resource "aws_acm_certificate" "test_cert" {
  private_key      = tls_private_key.test-matcher-key.private_key_pem
  certificate_body = tls_self_signed_cert.test_selfsigned_cert.cert_pem
}
`

Wait 12 hours, once the certificate expires... run terraform apply

`
Terraform will perform the following actions:

  # aws_acm_certificate.test_cert will be updated in-place
  ~ resource "aws_acm_certificate" "test_cert" {
        arn                       = "arn:aws:acm:us-west-1:123456789012:certificate/868a367f-151a-44d1-b930-daf7f28093e6"
      ~ certificate_body          = "40b0caab4f76f7ba7df5af338b00186bf7f2f3f6" -> (known after apply)
        domain_name               = "test-balancer-84ef6e3bf8619fee.elb.us-west-1.amazonaws.com"
        domain_validation_options = []
        id                        = "arn:aws:acm:us-west-1:123456789012:certificate/868a367f-151a-44d1-b930-daf7f28093e6"
        private_key               = (sensitive value)
        subject_alternative_names = []
        tags                      = {}
        validation_emails         = []
        validation_method         = "NONE"

        options {
            certificate_transparency_logging_preference = "DISABLED"
        }
    }

  # tls_self_signed_cert.test_selfsigned_cert must be replaced
-/+ resource "tls_self_signed_cert" "test_selfsigned_cert" {
        allowed_uses          = [
            "key_encipherment",
            "digital_signature",
            "server_auth",
        ]
      ~ cert_pem              = <<~EOT
            -----BEGIN CERTIFICATE-----
            MIIDgTCCAmmgAwIBAgIQWiE2/qxqJW9y50JZGX9KFTANBgkqhkiG9w0BAQsFADBh
            MRcwFQYDVQQKEw5BQklDIElSQUQgSW5jLjFGMEQGA1UEAxM9QklDLUJBTEFOQ0VS
            LTI0ZWY2ZTNiZjg2MTlmZWUuZWxiLnVzLWdvdi13ZXN0LTEuYW1hem9uYXdzLmNv
            bTAeFw0yMDA0MjEwNjA2MzlaFw0yMDA0MjExODA2MzlaMGExFzAVBgNVBAoTDkFC
            SUMgSVJBRCBJbmMuMUYwRAYDVQQDEz1CSUMtQkFMQU5DRVItMjRlZjZlM2JmODYx
            OWZlZS5lbGIudXMtZ292LXdlc3QtMS5hbWF6b25hd3MuY29tMIIBIjANBgkqhkiG
            9w0BAQEFAAOCAQ8AMIIBCgKCAQEArTWjd960ohnFKVt01zMx2phCby7WXI2H48C1
            5EXgY6zza5mWpextkNFlRz9dD9N/t/AurqOYkdcCMSTUiGP5iihCa5acPN1t1Uzf
            OJDhv/VEzz61lgzv+8AmZDL+YUGcZpWjLGPaiP8yoB3UCJWkEBQLY0nIV2YmHI/r
            aIONuuEYLJoVeOZqiYj+ncHzWpAl21+rZP+okzMnGt2sD5hKWYl+VTO4QwNX32NA
            NygszTx4hjF2gdWoYjrTtin8ZF1fmZmteRRD+TYBrzeW49P32rU8dEIEiEdR1K44
            yYIFSV3+FLroIvNGQRXsp+EPhzeiqzhmBkUZ2MCu+hmuxYjV2QIDAQABozUwMzAO
            BgNVHQ8BAf8EBAMCBaAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDAYDVR0TAQH/BAIw
            ADANBgkqhkiG9w0BAQsFAAOCAQEAaYdKgyUK5JSde1Av6N/8O95g/4UbsOg7ZIOU
            HK1zMOdyz+MLKYT0R1rWNx+Sgy7P1aDpYQBr0TxJQ1ehUrnsm5RCyRBCcl7sTi/y
            NvEzZuWyiPWFXUk8raUMEpey7tl72xRpmE2ZZXm0qXoxsrRZDgiqzHYk2hbkD9Mw
            Gqm7MdRX5sjJz+mJBWgg/gYO1N3ZtzRdW1Y7sU5zDquO7soF1cIdgWv3WSrtuAr2
            SITSxeCWKq0jGQnXzfknipOOmTVx4mLz19HMkvZdk02evOpMy8jtEMVS5zQdZYDN
            YS40+ydVALb9zJcFI2X4k7rFz40eQiITKv4OthD39UJVM1WWew==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        early_renewal_hours   = 0
      ~ id                    = "325232980844405698296007403978033678869" -> (known after apply)
        key_algorithm         = "RSA"
        private_key_pem       = (sensitive value)
      ~ ready_for_renewal     = false -> true # forces replacement
      ~ validity_end_time     = "2020-04-21T14:06:39.485175646-04:00" -> (known after apply)
        validity_period_hours = 12
      ~ validity_start_time   = "2020-04-21T02:06:39.485175646-04:00" -> (known after apply)

      ~ subject {
            common_name    = "test-balancer-84ef6e3bf8619fee.elb.us-west-1.amazonaws.com"
            organization   = "test Org"
          - street_address = [] -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

`


Error:

`
tls_self_signed_cert.test_selfsigned_cert: Destroying... [id=325232980844405698296007403978033678869]
tls_self_signed_cert.test_selfsigned_cert: Destruction complete after 0s
tls_self_signed_cert.test_selfsigned_cert: Creating...
tls_self_signed_cert.test_selfsigned_cert: Creation complete after 0s [id=43244458046184237001139417595109864816]
aws_acm_certificate.test_cert: Modifying... [id=arn:aws:acm:us-west-1:123456789012:certificate/868a367f-151a-44d1-b930-daf7f28093e6]

Error: Error updating certificate: ValidationException: Passed PEM was not a private key.
	status code: 400, request id: ccf842fb-5e53-41ec-bf3b-3aba82d3365e

  on main.tf line 150, in resource "aws_acm_certificate" "test_cert":
 150: resource "aws_acm_certificate" "test_cert" {
`

I don't understand why this happens, when the passed PEM is clearly the same TLS private key that was used to create the original aws_acm_certificate.  Therefore, I can create but not renew?